[S_Broadcast_Truth_Advent_Propaganda_Announcer_01 AkEvent]
SpokenText="ADVENT assures us this breakthrough will be available to all citizens immediately."

[S_Broadcast_Truth_Advent_Propaganda_Announcer_02 AkEvent]
SpokenText="We go live to the Speaker for more..."

[S_Intro_Advent_Propaganda_Announcer_01 AkEvent]
SpokenText="The ADVENT Administration reminds you to report all suspicious activity to your nearest peace keeper.  Remember, only together can we build a better tomorrow.  "

[S_Victory_Advent_Propaganda_Announcer_01 AkEvent]
SpokenText="Full curfew remains in effect as the administration deals with the ongoing crisis."

